{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "encoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 7], "dtype": "float32", "sparse": false, "name": "encoder_input"}, "inbound_nodes": []}, {"name": "conv2d", "class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"name": "leaky_re_lu", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "lambda", "class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAACQAAAAYAAAATAAAAc3gBAABkAWQAbACJAmQBZAJsAW0CfQEBAHwAXAJ9AokAiAJq\nA3wCgwGIAmoDiACDAQIAfQN9BIgFZANrAnKSfARkBBkAfANkBBkAAgCJAYkDfARkBWQEhQIZAHwD\nZAVkBIUCGQACAH0FiQSHAYcChwNmA2QGZAeECH0GhwNmAWQIZAeECH0HhwKHBGYCZAlkB4QIfQhu\nbIgFZAprAnLyfARkBRkAfANkBRkAAgCJAYkDfARkC2QMhQIZAHwDZAtkDIUCGQACAH0FiQSHAYcC\nhwNmA2QNZA6ECH0GhwNmAWQPZAeECH0HhwKHBGYCZBBkEYQIfQhuDHQEZBKIBRYAgwGCAYgCagWI\nAmoGiAGIA4MCfAF8B4gAgwKHAGYBZBNkB4QIgwOJAIgCagWIAmoHiAGIA4MCfAF8BogAgwKHAGYB\nZBRkB4QIgwOJAIgCagWIAmoIiAJqCXwFiASDAoMBfAF8CIgAgwKHAGYBZBVkB4QIgwOJAHwCiAAX\nAFMAKRZO6QAAAAApAdoHcGFydGlhbNoNY2hhbm5lbHNfbGFzdOkDAAAA6QEAAABjAQAAAAAAAAAB\nAAAACAAAABMAAABzKAAAAIgBagB8AGQBZAFnAmQBZAFnAmQBZAFnAmQBiAKIABgAZwJnBIMCUwAp\nAk5yAQAAACkB2gNwYWQpAdoBcikD2gNyX2PaAnRm2gN4X2OpAPozL2hvbWUvcmxvdXJlbmNvL3Jk\nY2VwX2Nsb3Vkcy9yZXByb2R1Y3Rpb24vbW9kZWxzLnB52gg8bGFtYmRhPjwAAABzAgAAAAQBeipy\nZXNpZHVhbF9hZGQuPGxvY2Fscz4uZm4uPGxvY2Fscz4uPGxhbWJkYT5jAQAAAAAAAAABAAAABgAA\nABMAAABzIAAAAHwAZABkAIUCZABkAIUCZABkAIUCZACIAIUCZgQZAFMAKQFOcgsAAAApAXIHAAAA\nKQFyCgAAAHILAAAAcgwAAAByDQAAAD8AAADzAAAAAGMBAAAAAAAAAAEAAAADAAAAEwAAAHMOAAAA\niABqAGoBfACIAYMCUwApAU4pAtoFaW1hZ2XaF3Jlc2l6ZV9uZWFyZXN0X25laWdoYm9yKQFyBwAA\nACkCcgkAAADaBHhfaHdyCwAAAHIMAAAAcg0AAABAAAAAcg4AAADaDmNoYW5uZWxzX2ZpcnN06QIA\nAADpBAAAAGMBAAAAAAAAAAEAAAAHAAAAEwAAAHMoAAAAiAFqAHwAZAFkAWcCZAGIAogAGABnAmQB\nZAFnAmQBZAFnAmcEgwJTACkCTnIBAAAAKQFyBgAAACkBcgcAAAApA3IIAAAAcgkAAAByCgAAAHIL\nAAAAcgwAAADaEHplcm9fcGFkX2NoYW5uZWxGAAAAcwIAAAAAAXoycmVzaWR1YWxfYWRkLjxsb2Nh\nbHM+LmZuLjxsb2NhbHM+Lnplcm9fcGFkX2NoYW5uZWxjAQAAAAAAAAABAAAABAAAABMAAABzFAAA\nAHwAZABkAIUCZACIAIUCZgIZAFMAKQFOcgsAAAApAXIHAAAAKQFyCgAAAHILAAAAcgwAAAByDQAA\nAEkAAAByDgAAAGMBAAAAAAAAAAEAAAAGAAAAEwAAAHM2AAAAiABqAHwAZAFkAmQDZARnBIMCfQCI\nAGoBagJ8AIgBgwJ9AIgAagB8AGQBZAJkA2QEZwSDAlMAKQVOcgEAAAByBAAAAHIFAAAAchMAAAAp\nA9oJdHJhbnNwb3Nlcg8AAAByEAAAACkBcgcAAAApAnIJAAAAchEAAAByCwAAAHIMAAAA2gZyZXNp\nemVLAAAAcwYAAAAAAhQBDgF6KHJlc2lkdWFsX2FkZC48bG9jYWxzPi5mbi48bG9jYWxzPi5yZXNp\nemV6GUludmFsaWQgZGF0YV9mb3JtYXQ6IGAlc2BjAAAAAAAAAAAAAAAAAQAAABMAAABzBAAAAIgA\nUwApAU5yCwAAAHILAAAAKQFyBwAAAHILAAAAcgwAAAByDQAAAFQAAAByDgAAAGMAAAAAAAAAAAAA\nAAABAAAAEwAAAHMEAAAAiABTACkBTnILAAAAcgsAAAApAXIHAAAAcgsAAAByDAAAAHINAAAAVQAA\nAHIOAAAAYwAAAAAAAAAAAAAAAAEAAAATAAAAcwQAAACIAFMAKQFOcgsAAAByCwAAACkBcgcAAABy\nCwAAAHIMAAAAcg0AAABXAAAAcg4AAAApCtoKdGVuc29yZmxvd9oJZnVuY3Rvb2xzcgIAAADaBXNo\nYXBl2gpWYWx1ZUVycm9y2gRjb25k2gdncmVhdGVy2gRsZXNz2gpyZWR1Y2VfYW552glub3RfZXF1\nYWwpCdoEYXJnc3ICAAAA2gF42gd4X3NoYXBl2gdyX3NoYXBl2gRyX2h3chUAAADaDXNsaWNlX2No\nYW5uZWxyFwAAACkB2gtkYXRhX2Zvcm1hdCkFcgcAAAByCAAAAHIJAAAAcgoAAAByEQAAAHIMAAAA\n2gJmbjAAAABzLAAAAAACCAEMAggBFgIIARIBGgIQAwwBEAIIARIBGgIQAwwCEAcMAiQBJAEEASYD\n", null, ["channels_last"]], "module": "models", "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["conv2d", 0, 0, {}]]]}, {"name": "batch_normalization", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAACQAAAAYAAAATAAAAc3gBAABkAWQAbACJAmQBZAJsAW0CfQEBAHwAXAJ9AokAiAJq\nA3wCgwGIAmoDiACDAQIAfQN9BIgFZANrAnKSfARkBBkAfANkBBkAAgCJAYkDfARkBWQEhQIZAHwD\nZAVkBIUCGQACAH0FiQSHAYcChwNmA2QGZAeECH0GhwNmAWQIZAeECH0HhwKHBGYCZAlkB4QIfQhu\nbIgFZAprAnLyfARkBRkAfANkBRkAAgCJAYkDfARkC2QMhQIZAHwDZAtkDIUCGQACAH0FiQSHAYcC\nhwNmA2QNZA6ECH0GhwNmAWQPZAeECH0HhwKHBGYCZBBkEYQIfQhuDHQEZBKIBRYAgwGCAYgCagWI\nAmoGiAGIA4MCfAF8B4gAgwKHAGYBZBNkB4QIgwOJAIgCagWIAmoHiAGIA4MCfAF8BogAgwKHAGYB\nZBRkB4QIgwOJAIgCagWIAmoIiAJqCXwFiASDAoMBfAF8CIgAgwKHAGYBZBVkB4QIgwOJAHwCiAAX\nAFMAKRZO6QAAAAApAdoHcGFydGlhbNoNY2hhbm5lbHNfbGFzdOkDAAAA6QEAAABjAQAAAAAAAAAB\nAAAACAAAABMAAABzKAAAAIgBagB8AGQBZAFnAmQBZAFnAmQBZAFnAmQBiAKIABgAZwJnBIMCUwAp\nAk5yAQAAACkB2gNwYWQpAdoBcikD2gNyX2PaAnRm2gN4X2OpAPozL2hvbWUvcmxvdXJlbmNvL3Jk\nY2VwX2Nsb3Vkcy9yZXByb2R1Y3Rpb24vbW9kZWxzLnB52gg8bGFtYmRhPjwAAABzAgAAAAQBeipy\nZXNpZHVhbF9hZGQuPGxvY2Fscz4uZm4uPGxvY2Fscz4uPGxhbWJkYT5jAQAAAAAAAAABAAAABgAA\nABMAAABzIAAAAHwAZABkAIUCZABkAIUCZABkAIUCZACIAIUCZgQZAFMAKQFOcgsAAAApAXIHAAAA\nKQFyCgAAAHILAAAAcgwAAAByDQAAAD8AAADzAAAAAGMBAAAAAAAAAAEAAAADAAAAEwAAAHMOAAAA\niABqAGoBfACIAYMCUwApAU4pAtoFaW1hZ2XaF3Jlc2l6ZV9uZWFyZXN0X25laWdoYm9yKQFyBwAA\nACkCcgkAAADaBHhfaHdyCwAAAHIMAAAAcg0AAABAAAAAcg4AAADaDmNoYW5uZWxzX2ZpcnN06QIA\nAADpBAAAAGMBAAAAAAAAAAEAAAAHAAAAEwAAAHMoAAAAiAFqAHwAZAFkAWcCZAGIAogAGABnAmQB\nZAFnAmQBZAFnAmcEgwJTACkCTnIBAAAAKQFyBgAAACkBcgcAAAApA3IIAAAAcgkAAAByCgAAAHIL\nAAAAcgwAAADaEHplcm9fcGFkX2NoYW5uZWxGAAAAcwIAAAAAAXoycmVzaWR1YWxfYWRkLjxsb2Nh\nbHM+LmZuLjxsb2NhbHM+Lnplcm9fcGFkX2NoYW5uZWxjAQAAAAAAAAABAAAABAAAABMAAABzFAAA\nAHwAZABkAIUCZACIAIUCZgIZAFMAKQFOcgsAAAApAXIHAAAAKQFyCgAAAHILAAAAcgwAAAByDQAA\nAEkAAAByDgAAAGMBAAAAAAAAAAEAAAAGAAAAEwAAAHM2AAAAiABqAHwAZAFkAmQDZARnBIMCfQCI\nAGoBagJ8AIgBgwJ9AIgAagB8AGQBZAJkA2QEZwSDAlMAKQVOcgEAAAByBAAAAHIFAAAAchMAAAAp\nA9oJdHJhbnNwb3Nlcg8AAAByEAAAACkBcgcAAAApAnIJAAAAchEAAAByCwAAAHIMAAAA2gZyZXNp\nemVLAAAAcwYAAAAAAhQBDgF6KHJlc2lkdWFsX2FkZC48bG9jYWxzPi5mbi48bG9jYWxzPi5yZXNp\nemV6GUludmFsaWQgZGF0YV9mb3JtYXQ6IGAlc2BjAAAAAAAAAAAAAAAAAQAAABMAAABzBAAAAIgA\nUwApAU5yCwAAAHILAAAAKQFyBwAAAHILAAAAcgwAAAByDQAAAFQAAAByDgAAAGMAAAAAAAAAAAAA\nAAABAAAAEwAAAHMEAAAAiABTACkBTnILAAAAcgsAAAApAXIHAAAAcgsAAAByDAAAAHINAAAAVQAA\nAHIOAAAAYwAAAAAAAAAAAAAAAAEAAAATAAAAcwQAAACIAFMAKQFOcgsAAAByCwAAACkBcgcAAABy\nCwAAAHIMAAAAcg0AAABXAAAAcg4AAAApCtoKdGVuc29yZmxvd9oJZnVuY3Rvb2xzcgIAAADaBXNo\nYXBl2gpWYWx1ZUVycm9y2gRjb25k2gdncmVhdGVy2gRsZXNz2gpyZWR1Y2VfYW552glub3RfZXF1\nYWwpCdoEYXJnc3ICAAAA2gF42gd4X3NoYXBl2gdyX3NoYXBl2gRyX2h3chUAAADaDXNsaWNlX2No\nYW5uZWxyFwAAACkB2gtkYXRhX2Zvcm1hdCkFcgcAAAByCAAAAHIJAAAAcgoAAAByEQAAAHIMAAAA\n2gJmbjAAAABzLAAAAAACCAEMAggBFgIIARIBGgIQAwwBEAIIARIBGgIQAwwCEAcMAiQBJAEEASYD\n", null, ["channels_last"]], "module": "models", "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["batch_normalization", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAACQAAAAYAAAATAAAAc3gBAABkAWQAbACJAmQBZAJsAW0CfQEBAHwAXAJ9AokAiAJq\nA3wCgwGIAmoDiACDAQIAfQN9BIgFZANrAnKSfARkBBkAfANkBBkAAgCJAYkDfARkBWQEhQIZAHwD\nZAVkBIUCGQACAH0FiQSHAYcChwNmA2QGZAeECH0GhwNmAWQIZAeECH0HhwKHBGYCZAlkB4QIfQhu\nbIgFZAprAnLyfARkBRkAfANkBRkAAgCJAYkDfARkC2QMhQIZAHwDZAtkDIUCGQACAH0FiQSHAYcC\nhwNmA2QNZA6ECH0GhwNmAWQPZAeECH0HhwKHBGYCZBBkEYQIfQhuDHQEZBKIBRYAgwGCAYgCagWI\nAmoGiAGIA4MCfAF8B4gAgwKHAGYBZBNkB4QIgwOJAIgCagWIAmoHiAGIA4MCfAF8BogAgwKHAGYB\nZBRkB4QIgwOJAIgCagWIAmoIiAJqCXwFiASDAoMBfAF8CIgAgwKHAGYBZBVkB4QIgwOJAHwCiAAX\nAFMAKRZO6QAAAAApAdoHcGFydGlhbNoNY2hhbm5lbHNfbGFzdOkDAAAA6QEAAABjAQAAAAAAAAAB\nAAAACAAAABMAAABzKAAAAIgBagB8AGQBZAFnAmQBZAFnAmQBZAFnAmQBiAKIABgAZwJnBIMCUwAp\nAk5yAQAAACkB2gNwYWQpAdoBcikD2gNyX2PaAnRm2gN4X2OpAPozL2hvbWUvcmxvdXJlbmNvL3Jk\nY2VwX2Nsb3Vkcy9yZXByb2R1Y3Rpb24vbW9kZWxzLnB52gg8bGFtYmRhPjwAAABzAgAAAAQBeipy\nZXNpZHVhbF9hZGQuPGxvY2Fscz4uZm4uPGxvY2Fscz4uPGxhbWJkYT5jAQAAAAAAAAABAAAABgAA\nABMAAABzIAAAAHwAZABkAIUCZABkAIUCZABkAIUCZACIAIUCZgQZAFMAKQFOcgsAAAApAXIHAAAA\nKQFyCgAAAHILAAAAcgwAAAByDQAAAD8AAADzAAAAAGMBAAAAAAAAAAEAAAADAAAAEwAAAHMOAAAA\niABqAGoBfACIAYMCUwApAU4pAtoFaW1hZ2XaF3Jlc2l6ZV9uZWFyZXN0X25laWdoYm9yKQFyBwAA\nACkCcgkAAADaBHhfaHdyCwAAAHIMAAAAcg0AAABAAAAAcg4AAADaDmNoYW5uZWxzX2ZpcnN06QIA\nAADpBAAAAGMBAAAAAAAAAAEAAAAHAAAAEwAAAHMoAAAAiAFqAHwAZAFkAWcCZAGIAogAGABnAmQB\nZAFnAmQBZAFnAmcEgwJTACkCTnIBAAAAKQFyBgAAACkBcgcAAAApA3IIAAAAcgkAAAByCgAAAHIL\nAAAAcgwAAADaEHplcm9fcGFkX2NoYW5uZWxGAAAAcwIAAAAAAXoycmVzaWR1YWxfYWRkLjxsb2Nh\nbHM+LmZuLjxsb2NhbHM+Lnplcm9fcGFkX2NoYW5uZWxjAQAAAAAAAAABAAAABAAAABMAAABzFAAA\nAHwAZABkAIUCZACIAIUCZgIZAFMAKQFOcgsAAAApAXIHAAAAKQFyCgAAAHILAAAAcgwAAAByDQAA\nAEkAAAByDgAAAGMBAAAAAAAAAAEAAAAGAAAAEwAAAHM2AAAAiABqAHwAZAFkAmQDZARnBIMCfQCI\nAGoBagJ8AIgBgwJ9AIgAagB8AGQBZAJkA2QEZwSDAlMAKQVOcgEAAAByBAAAAHIFAAAAchMAAAAp\nA9oJdHJhbnNwb3Nlcg8AAAByEAAAACkBcgcAAAApAnIJAAAAchEAAAByCwAAAHIMAAAA2gZyZXNp\nemVLAAAAcwYAAAAAAhQBDgF6KHJlc2lkdWFsX2FkZC48bG9jYWxzPi5mbi48bG9jYWxzPi5yZXNp\nemV6GUludmFsaWQgZGF0YV9mb3JtYXQ6IGAlc2BjAAAAAAAAAAAAAAAAAQAAABMAAABzBAAAAIgA\nUwApAU5yCwAAAHILAAAAKQFyBwAAAHILAAAAcgwAAAByDQAAAFQAAAByDgAAAGMAAAAAAAAAAAAA\nAAABAAAAEwAAAHMEAAAAiABTACkBTnILAAAAcgsAAAApAXIHAAAAcgsAAAByDAAAAHINAAAAVQAA\nAHIOAAAAYwAAAAAAAAAAAAAAAAEAAAATAAAAcwQAAACIAFMAKQFOcgsAAAByCwAAACkBcgcAAABy\nCwAAAHIMAAAAcg0AAABXAAAAcg4AAAApCtoKdGVuc29yZmxvd9oJZnVuY3Rvb2xzcgIAAADaBXNo\nYXBl2gpWYWx1ZUVycm9y2gRjb25k2gdncmVhdGVy2gRsZXNz2gpyZWR1Y2VfYW552glub3RfZXF1\nYWwpCdoEYXJnc3ICAAAA2gF42gd4X3NoYXBl2gdyX3NoYXBl2gRyX2h3chUAAADaDXNsaWNlX2No\nYW5uZWxyFwAAACkB2gtkYXRhX2Zvcm1hdCkFcgcAAAByCAAAAHIJAAAAcgoAAAByEQAAAHIMAAAA\n2gJmbjAAAABzLAAAAAACCAEMAggBFgIIARIBGgIQAwwBEAIIARIBGgIQAwwCEAcMAiQBJAEEASYD\n", null, ["channels_last"]], "module": "models", "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAACQAAAAYAAAATAAAAc3gBAABkAWQAbACJAmQBZAJsAW0CfQEBAHwAXAJ9AokAiAJq\nA3wCgwGIAmoDiACDAQIAfQN9BIgFZANrAnKSfARkBBkAfANkBBkAAgCJAYkDfARkBWQEhQIZAHwD\nZAVkBIUCGQACAH0FiQSHAYcChwNmA2QGZAeECH0GhwNmAWQIZAeECH0HhwKHBGYCZAlkB4QIfQhu\nbIgFZAprAnLyfARkBRkAfANkBRkAAgCJAYkDfARkC2QMhQIZAHwDZAtkDIUCGQACAH0FiQSHAYcC\nhwNmA2QNZA6ECH0GhwNmAWQPZAeECH0HhwKHBGYCZBBkEYQIfQhuDHQEZBKIBRYAgwGCAYgCagWI\nAmoGiAGIA4MCfAF8B4gAgwKHAGYBZBNkB4QIgwOJAIgCagWIAmoHiAGIA4MCfAF8BogAgwKHAGYB\nZBRkB4QIgwOJAIgCagWIAmoIiAJqCXwFiASDAoMBfAF8CIgAgwKHAGYBZBVkB4QIgwOJAHwCiAAX\nAFMAKRZO6QAAAAApAdoHcGFydGlhbNoNY2hhbm5lbHNfbGFzdOkDAAAA6QEAAABjAQAAAAAAAAAB\nAAAACAAAABMAAABzKAAAAIgBagB8AGQBZAFnAmQBZAFnAmQBZAFnAmQBiAKIABgAZwJnBIMCUwAp\nAk5yAQAAACkB2gNwYWQpAdoBcikD2gNyX2PaAnRm2gN4X2OpAPozL2hvbWUvcmxvdXJlbmNvL3Jk\nY2VwX2Nsb3Vkcy9yZXByb2R1Y3Rpb24vbW9kZWxzLnB52gg8bGFtYmRhPjwAAABzAgAAAAQBeipy\nZXNpZHVhbF9hZGQuPGxvY2Fscz4uZm4uPGxvY2Fscz4uPGxhbWJkYT5jAQAAAAAAAAABAAAABgAA\nABMAAABzIAAAAHwAZABkAIUCZABkAIUCZABkAIUCZACIAIUCZgQZAFMAKQFOcgsAAAApAXIHAAAA\nKQFyCgAAAHILAAAAcgwAAAByDQAAAD8AAADzAAAAAGMBAAAAAAAAAAEAAAADAAAAEwAAAHMOAAAA\niABqAGoBfACIAYMCUwApAU4pAtoFaW1hZ2XaF3Jlc2l6ZV9uZWFyZXN0X25laWdoYm9yKQFyBwAA\nACkCcgkAAADaBHhfaHdyCwAAAHIMAAAAcg0AAABAAAAAcg4AAADaDmNoYW5uZWxzX2ZpcnN06QIA\nAADpBAAAAGMBAAAAAAAAAAEAAAAHAAAAEwAAAHMoAAAAiAFqAHwAZAFkAWcCZAGIAogAGABnAmQB\nZAFnAmQBZAFnAmcEgwJTACkCTnIBAAAAKQFyBgAAACkBcgcAAAApA3IIAAAAcgkAAAByCgAAAHIL\nAAAAcgwAAADaEHplcm9fcGFkX2NoYW5uZWxGAAAAcwIAAAAAAXoycmVzaWR1YWxfYWRkLjxsb2Nh\nbHM+LmZuLjxsb2NhbHM+Lnplcm9fcGFkX2NoYW5uZWxjAQAAAAAAAAABAAAABAAAABMAAABzFAAA\nAHwAZABkAIUCZACIAIUCZgIZAFMAKQFOcgsAAAApAXIHAAAAKQFyCgAAAHILAAAAcgwAAAByDQAA\nAEkAAAByDgAAAGMBAAAAAAAAAAEAAAAGAAAAEwAAAHM2AAAAiABqAHwAZAFkAmQDZARnBIMCfQCI\nAGoBagJ8AIgBgwJ9AIgAagB8AGQBZAJkA2QEZwSDAlMAKQVOcgEAAAByBAAAAHIFAAAAchMAAAAp\nA9oJdHJhbnNwb3Nlcg8AAAByEAAAACkBcgcAAAApAnIJAAAAchEAAAByCwAAAHIMAAAA2gZyZXNp\nemVLAAAAcwYAAAAAAhQBDgF6KHJlc2lkdWFsX2FkZC48bG9jYWxzPi5mbi48bG9jYWxzPi5yZXNp\nemV6GUludmFsaWQgZGF0YV9mb3JtYXQ6IGAlc2BjAAAAAAAAAAAAAAAAAQAAABMAAABzBAAAAIgA\nUwApAU5yCwAAAHILAAAAKQFyBwAAAHILAAAAcgwAAAByDQAAAFQAAAByDgAAAGMAAAAAAAAAAAAA\nAAABAAAAEwAAAHMEAAAAiABTACkBTnILAAAAcgsAAAApAXIHAAAAcgsAAAByDAAAAHINAAAAVQAA\nAHIOAAAAYwAAAAAAAAAAAAAAAAEAAAATAAAAcwQAAACIAFMAKQFOcgsAAAByCwAAACkBcgcAAABy\nCwAAAHIMAAAAcg0AAABXAAAAcg4AAAApCtoKdGVuc29yZmxvd9oJZnVuY3Rvb2xzcgIAAADaBXNo\nYXBl2gpWYWx1ZUVycm9y2gRjb25k2gdncmVhdGVy2gRsZXNz2gpyZWR1Y2VfYW552glub3RfZXF1\nYWwpCdoEYXJnc3ICAAAA2gF42gd4X3NoYXBl2gdyX3NoYXBl2gRyX2h3chUAAADaDXNsaWNlX2No\nYW5uZWxyFwAAACkB2gtkYXRhX2Zvcm1hdCkFcgcAAAByCAAAAHIJAAAAcgoAAAByEQAAAHIMAAAA\n2gJmbjAAAABzLAAAAAACCAEMAggBFgIIARIBGgIQAwwBEAIIARIBGgIQAwwCEAcMAiQBJAEEASYD\n", null, ["channels_last"]], "module": "models", "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lambda_3", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "dense", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["encoder_input", 0, 0]], "output_layers": [["leaky_re_lu_8", 0, 0]]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}